app/controllers/books_controller.rb

INSERT INTO "books" ("title", "picture", "version", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save